app/Controllers/ContratanteController.php

SELECT *
FROM `contratante`
WHERE `user_id` = 23
---
    public function minhaempresa()
    {
        $data['acao'] = 'Salvar';

        $user_id = user_id();

        if ($this->VerificaCadastroInformacoes() >= 1){

            $contratanteModel = new contratanteModel();
            $data['contratantes'] = $contratanteModel->where('user_id',$user_id)->find();

SELECT *
FROM `eventos`
WHERE `user_id` = 20
SELECT *
FROM `cargos`
---
        //exibir eventos
        $user_id = user_id();
        $eventosModel = new \App\Models\eventosModel();
        $data['eventos'] = $eventosModel->where('user_id',$user_id)->find();

        //exibir cargos
        $cargoModel = new \App\Models\cargosModel();
        $data['cargos'] = $cargoModel->findAll();

SELECT *
FROM `freelancer`
---
                'pager' => $freelancerModel->pager
            ];*/

            $freelancer = $freelancerModel->findAll();