app/Controllers/ContratanteController.php

SELECT *
FROM `cargos`
---
    public function busca()
    {


        //exibir cargos
        $cargoModel = new \App\Models\cargosModel();
        $data['cargos'] = $cargoModel->findAll();

SELECT *
FROM `freelancer`
---
        {
            $freelancerModel = new \App\Models\freelancerModel();

            /*$data = [
                'freelacers' => $freelancerModel->paginate(10),
                'pager' => $freelancerModel->pager
            ];*/