app/Controllers/ContratanteController.php

INSERT INTO `eventos` (`nome`, `descricao`, `data`, `endereco`, `cidade`, `vagas`, `status`, `user_id`) VALUES ('show 2', 'funk', '2025-05-08', 'Rua Buenos Aires 402', 'Teixeiras', 'Motoboy', 'Disponivel', 15)
---
    public function vagaspub()
    {
        $data['msg'] = '';
        $db = db_connect();

        if($this->VerificaCadastroInformacoes() >= 1){
            if($this->request->getMethod() == 'POST'){
                $btneventos = $this->request->getPost('btn-eventos');
                if($btneventos == 'adicionarevento'){
                    $btnEventoId = $this->request->getPost('eventoId');
                    if($btnEventoId == ''){ //cadastrar evento
                        $eventosModel = new \App\Models\eventosModel();
                        $eventosModel->set('nome', $this->request->getPost('nome'));
                        $eventosModel->set('descricao',  $this->request->getPost('descricao'));
                        $eventosModel->set('data',$this->request->getPost('data'));
                        $eventosModel->set('endereco', $this->request->getPost('endereco'));
                        $eventosModel->set('cidade', $this->request->getPost('cidade'));
                        $eventosModel->set('status',  $this->request->getPost('status'));
                        $eventosModel->set('user_id', user_id());

                        if($eventosModel->insert()){

SELECT *
FROM `eventos`
WHERE `user_id` = 15
SELECT *
FROM `cargos`
---
        //exibir eventos
        $user_id = user_id();
        $eventosModel = new \App\Models\eventosModel();
        $data['eventos'] = $eventosModel->where('user_id',$user_id)->find();

        //exibir cargos
        $cargoModel = new \App\Models\cargosModel();
        $data['cargos'] = $cargoModel->findAll();

DELETE FROM `vagas`
WHERE `id` IN ('29')
---
    public function deleteVagas($id){
        $vagasModel = new \App\Models\vagasModel();
        if($vagasModel->delete($id)){