app/Controllers/FreelancerController.php

SELECT *
FROM `cargos`
---
    public function telabusca(){

        $db = db_connect();
        //exibir vagas
        $sql = 'SELECT V.id,V.evento_id, E.nome,E.endereco,E.cidade,E.data,E.descricao, C.cargo, V.cargo_id,V.valor
                                           FROM eventos as E JOIN vagas as V ON V.evento_id = E.id
				                            JOIN cargos as C ON V.cargo_id = C.id';
        $data['vagas'] = $db->connID->query($sql);



        //exibir cargos
        $cargoModel = new \App\Models\cargosModel();
        $data['cargos'] = $cargoModel->findAll();