app/Controllers/FreelancerController.php

UPDATE `contratados` SET `status` = 1
WHERE `contratados`.`id` IN ('67')
SELECT *
FROM `contratados`
WHERE `freelancer_id` = 14
AND `evento_id` = '38'
AND `id` != '67'
---

                    $contratados['status'] = true;

                    if($contratadosModel->update($idVaga, $contratados))
                    {
                        $contratadosModel = new contratadosModel();

                        $contratados = $contratadosModel->where('freelancer_id',$user_id)->where('evento_id',$idEvento)->where('id !=', $idVaga)->findAll();

UPDATE `contratados` SET `status` = 0
WHERE `contratados`.`id` IN ('63')
---
                        foreach($contratados as $contratado){
                            $contratado['status'] = false;

                            $contratadosModel->update($contratado['id'], $contratado);