app/Controllers/FreelancerController.php

SELECT *
FROM `freelancer`
WHERE `user_id` = 14
SELECT *
FROM `cargos`
INSERT INTO `cargo_freelancer` (`user_id`, `cargo_id`) VALUES (14, 1)
---
    public function meucurriculo(){

        $data['acao'] = 'Salvar';
        $user_id = user_id();
        $db = db_connect();
        $sql = 'SELECT user_id FROM `freelancer` WHERE user_id = ' .$user_id ;
        $resultado = $db->connID->query($sql);
        $num_rows = mysqli_num_rows($resultado);

        if ($num_rows >= 1){

            $freelancerModel = new \App\Models\freelancerModel();
            $data['freelancers'] = $freelancerModel->where('user_id',$user_id)->find();;

            //exibir cargos
            $cargoModel = new \App\Models\cargosModel();
            $data['cargos'] = $cargoModel->findAll();

            //iserir cargo ao freelancer
            if($this->request->getMethod() === 'POST'){
                $cargofreelancerModel = new \App\Models\cargofreelancerModel();
                $cargos_id = intval($this->request->getPost('cargo_id'));
                $cargofreelancerModel->set('user_id', user_id());
                $cargofreelancerModel->set('cargo_id', $cargos_id);

                $cargofreelancerModel->insert();